import React, { Component } from "react";
import "./Guidance.css";

class ScoreGuidance extends Component {
    render() {
        return (
            <div className="start-guidance mt-4 mb-4 animate__animated animate__bounce">
                <div className="start-guidance-content">
                    <strong>راهنما</strong>
                    <br></br>
                    <p className="mt-3">
                        در اینجا به تمام حریف هایتان باید نسبت به پاسخ هایشان
                        امتیاز بدید. در یک بخش پاسخ های یک فرد را نوشته ایم و در
                        بخش دیگر باید به آن حریف امتیاز بدید. در بخش امتیاز دهی
                        برای هر کلمه میتوانید امتیاز های 0 , 5 , 10 را به آن
                        کلمه بدهید. برای مثال در خط اول باید به اسمی که آن کاربر
                        نوشته است امتیاز بدید یکی از دکمه ها برابر است با (اسم :
                        0) این یعنی که شما به کلمه اسم آن کاربر امتیاز 0 را
                        میدهید و (اسم : 5) یعنی امتیاز 5 را میدهید و همین موضوع
                        برای امتیاز ده هم هست ! و همینطور به همه ی کلمات آن
                        کاربر با همین روش امتیاز میدهید. زمانی که به یک کاربر
                        امتیاز دادید روی دکمه ثبت بخش امتیاز دهی آن کاربر بزنید
                        تا ثبت شود و زمانی که به همه ی کاربران امتیاز دادید روی
                        دکمه (امتیاز دهی من تمام شد) بزنید. زمانی که همه اعضای
                        اتاق امتیازشان را دادند سازنده اتاق میتواند بازی را
                        دوباره شروع یا کلا تمام کند.
                    </p>
                </div>
            </div>
        );
    }
}

export default ScoreGuidance;
